In [1]:
import os

import math

import numpy as np
import pandas as pd
pd.set_option('display.max_rows',20)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns',10)

import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')

In [2]:
df = pd.DataFrame({'name': ['Alice', 'Bob', 'Carol', 'Dave', 'Eve', 'Frank'],
    'gender': ['Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'age': [24, 34, 44, 41, 52, 43],
    'marital_status': [0, 2, 1, 2, 0, 1]}).\
        set_index('name')

In [3]:
df

       age  gender  marital_status
name
Alice   24  Female               0
Bob     34    Male               2
Carol   44  Female               1
Dave    41    Male               2
Eve     52  Female               0
Frank   43    Male               1

In [4]:
df[['age','gender']]

       age  gender
name
Alice   24  Female
Bob     34    Male
Carol   44  Female
Dave    41    Male
Eve     52  Female
Frank   43    Male

In [5]:
df[['age']]

       age
name
Alice   24
Bob     34
Carol   44
Dave    41
Eve     52
Frank   43

In [6]:
df['age']

name
Alice    24
Bob      34
Carol    44
Dave     41
Eve      52
Frank    43
Name: age, dtype: int64

In [7]:
df.loc[['Bob','Carol']]

       age  gender  marital_status
name
Bob     34    Male               2
Carol   44  Female               1

In [8]:
df.loc[['Eve']]

      age  gender  marital_status
name
Eve    52  Female               0

In [9]:
df.loc[['Dave']]

      age gender  marital_status
name
Dave   41   Male               2

In [10]:
df.age.Frank

43

In [11]:
df.at['Frank','age']

43

In [13]:
df[df['gender']=='Male']['age'].mean()

39.333333333333336